package com.zhuanche.common.enums;

public enum EnumCallReleaseCause {
    SY0("未返回"),
    SY1("未分配号码"),
    SY2("无路由到指定的转接网"),
    SY3("无路由到目的地 "),
    SY4("发送专用信息音"),
    SY16("正常的呼叫拆线"),
    SY17("用户忙"),
    SY18("用户未响应"),
    SY19("用户未应答"),
    SY20("用户缺席"),
    SY21("呼叫拒收"),
    SY22("号码改变"),
    SY27("目的地不可达 "),
    SY28("无效的号码格式（地址不全）"),
    SY29("性能拒绝"),
    SY31("正常—未指定"),
    SY34("无电路/通路可用"),
    SY42("交换设备拥塞"),
    SY44("未知响应码"),
    SY50("所请求的性能未预定"),
    SY53("CUG中限制去呼叫"),
    SY55("CUG中限制来呼叫"),
    SY57("承载能力无权"),
    SY58("承载能力目前不可用"),
    SY65("承载能力未实现"),
    SY69("所请求的性能未实现"),
    SY87("被叫用户不是CUG的成员"),
    SY88("不兼容的目的地"),
    SY90("不存在的CUG"),
    SY91("无效的转接网选择"),
    SY95("无效的消息，未指定"),
    SY97("消息类型不存在或未实现"),
    SY99("参数不存在或未实现"),
    SY102("定时器终了时恢复"),
    SY103("参数不存在或未实现—传递"),
    SY110("消息带有未被识别的参数—舍弃"),
    SY111("协议错误，未指定"),
    SY127("互通，未指定"),
    SY144("信号不稳定"),
    /** 移客通新增 */
    SY201("通话成功"),
    SY202("被叫忙"),
    SY203("被叫无应答"),
    SY204("被叫拒接"),
    SY205("主叫前挂机"),
    SY206("空号"),
    SY207("关机"),
    SY208("暂时无法接听"),
    SY209("停机"),
    SY210("无绑定关系"),
    SY211("号码查询接口超时"),
    SY212("黑名单号码"),
    SY213("号码查询接口解析错误"),
    SY214("被叫不支持，被叫非国内手机或固话号码"),
    SY215("呼叫转移，运营商不允许二次呼转"),
    SY216("其他失败情形");

    private String name;

    private EnumCallReleaseCause(String type){
        this.name = type;
    }

    public String getMsg(){
        return name;
    }

}
